Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC38x/IfxPort_PinMap_TC38x_LFBGA516.c
/**
 * \file IfxPort_PinMap_TC38x_LFBGA516.c
 * \brief PORT I/O map
 * \ingroup IfxLld_Port
 *
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 */

#include "Ifx_Cfg.h"
#if defined (__TASKING__)
#pragma warning 508		/* To suppress empty file warning */
#endif
#if defined (__ghs__)
#pragma diag_suppress 96		/* To suppress empty file warning */
#endif
#if defined DEVICE_TC38X && defined IFX_PIN_PACKAGE_LFBGA516
#include "IfxPort_PinMap_TC38x_LFBGA516.h" 

IfxPort_Pin IfxPort_P00_0 = {&MODULE_P00, 0};
IfxPort_Pin IfxPort_P00_1 = {&MODULE_P00, 1};
IfxPort_Pin IfxPort_P00_10 = {&MODULE_P00,10};
IfxPort_Pin IfxPort_P00_11 = {&MODULE_P00,11};
IfxPort_Pin IfxPort_P00_12 = {&MODULE_P00,12};
IfxPort_Pin IfxPort_P00_13 = {&MODULE_P00,13};
IfxPort_Pin IfxPort_P00_14 = {&MODULE_P00,14};
IfxPort_Pin IfxPort_P00_15 = {&MODULE_P00,15};
IfxPort_Pin IfxPort_P00_2 = {&MODULE_P00, 2};
IfxPort_Pin IfxPort_P00_3 = {&MODULE_P00, 3};
IfxPort_Pin IfxPort_P00_4 = {&MODULE_P00, 4};
IfxPort_Pin IfxPort_P00_5 = {&MODULE_P00, 5};
IfxPort_Pin IfxPort_P00_6 = {&MODULE_P00, 6};
IfxPort_Pin IfxPort_P00_7 = {&MODULE_P00, 7};
IfxPort_Pin IfxPort_P00_8 = {&MODULE_P00, 8};
IfxPort_Pin IfxPort_P00_9 = {&MODULE_P00, 9};
IfxPort_Pin IfxPort_P01_0 = {&MODULE_P01, 0};
IfxPort_Pin IfxPort_P01_1 = {&MODULE_P01, 1};
IfxPort_Pin IfxPort_P01_10 = {&MODULE_P01,10};
IfxPort_Pin IfxPort_P01_11 = {&MODULE_P01,11};
IfxPort_Pin IfxPort_P01_12 = {&MODULE_P01,12};
IfxPort_Pin IfxPort_P01_13 = {&MODULE_P01,13};
IfxPort_Pin IfxPort_P01_14 = {&MODULE_P01,14};
IfxPort_Pin IfxPort_P01_15 = {&MODULE_P01,15};
IfxPort_Pin IfxPort_P01_2 = {&MODULE_P01, 2};
IfxPort_Pin IfxPort_P01_3 = {&MODULE_P01, 3};
IfxPort_Pin IfxPort_P01_4 = {&MODULE_P01, 4};
IfxPort_Pin IfxPort_P01_5 = {&MODULE_P01, 5};
IfxPort_Pin IfxPort_P01_6 = {&MODULE_P01, 6};
IfxPort_Pin IfxPort_P01_7 = {&MODULE_P01, 7};
IfxPort_Pin IfxPort_P01_8 = {&MODULE_P01, 8};
IfxPort_Pin IfxPort_P01_9 = {&MODULE_P01, 9};
IfxPort_Pin IfxPort_P02_0 = {&MODULE_P02, 0};
IfxPort_Pin IfxPort_P02_1 = {&MODULE_P02, 1};
IfxPort_Pin IfxPort_P02_10 = {&MODULE_P02,10};
IfxPort_Pin IfxPort_P02_11 = {&MODULE_P02,11};
IfxPort_Pin IfxPort_P02_12 = {&MODULE_P02,12};
IfxPort_Pin IfxPort_P02_13 = {&MODULE_P02,13};
IfxPort_Pin IfxPort_P02_14 = {&MODULE_P02,14};
IfxPort_Pin IfxPort_P02_15 = {&MODULE_P02,15};
IfxPort_Pin IfxPort_P02_2 = {&MODULE_P02, 2};
IfxPort_Pin IfxPort_P02_3 = {&MODULE_P02, 3};
IfxPort_Pin IfxPort_P02_4 = {&MODULE_P02, 4};
IfxPort_Pin IfxPort_P02_5 = {&MODULE_P02, 5};
IfxPort_Pin IfxPort_P02_6 = {&MODULE_P02, 6};
IfxPort_Pin IfxPort_P02_7 = {&MODULE_P02, 7};
IfxPort_Pin IfxPort_P02_8 = {&MODULE_P02, 8};
IfxPort_Pin IfxPort_P02_9 = {&MODULE_P02, 9};
IfxPort_Pin IfxPort_P10_0 = {&MODULE_P10, 0};
IfxPort_Pin IfxPort_P10_1 = {&MODULE_P10, 1};
IfxPort_Pin IfxPort_P10_10 = {&MODULE_P10,10};
IfxPort_Pin IfxPort_P10_11 = {&MODULE_P10,11};
IfxPort_Pin IfxPort_P10_13 = {&MODULE_P10,13};
IfxPort_Pin IfxPort_P10_14 = {&MODULE_P10,14};
IfxPort_Pin IfxPort_P10_15 = {&MODULE_P10,15};
IfxPort_Pin IfxPort_P10_2 = {&MODULE_P10, 2};
IfxPort_Pin IfxPort_P10_3 = {&MODULE_P10, 3};
IfxPort_Pin IfxPort_P10_4 = {&MODULE_P10, 4};
IfxPort_Pin IfxPort_P10_5 = {&MODULE_P10, 5};
IfxPort_Pin IfxPort_P10_6 = {&MODULE_P10, 6};
IfxPort_Pin IfxPort_P10_7 = {&MODULE_P10, 7};
IfxPort_Pin IfxPort_P10_8 = {&MODULE_P10, 8};
IfxPort_Pin IfxPort_P10_9 = {&MODULE_P10, 9};
IfxPort_Pin IfxPort_P11_0 = {&MODULE_P11, 0};
IfxPort_Pin IfxPort_P11_1 = {&MODULE_P11, 1};
IfxPort_Pin IfxPort_P11_10 = {&MODULE_P11,10};
IfxPort_Pin IfxPort_P11_11 = {&MODULE_P11,11};
IfxPort_Pin IfxPort_P11_12 = {&MODULE_P11,12};
IfxPort_Pin IfxPort_P11_13 = {&MODULE_P11,13};
IfxPort_Pin IfxPort_P11_14 = {&MODULE_P11,14};
IfxPort_Pin IfxPort_P11_15 = {&MODULE_P11,15};
IfxPort_Pin IfxPort_P11_2 = {&MODULE_P11, 2};
IfxPort_Pin IfxPort_P11_3 = {&MODULE_P11, 3};
IfxPort_Pin IfxPort_P11_4 = {&MODULE_P11, 4};
IfxPort_Pin IfxPort_P11_5 = {&MODULE_P11, 5};
IfxPort_Pin IfxPort_P11_6 = {&MODULE_P11, 6};
IfxPort_Pin IfxPort_P11_7 = {&MODULE_P11, 7};
IfxPort_Pin IfxPort_P11_8 = {&MODULE_P11, 8};
IfxPort_Pin IfxPort_P11_9 = {&MODULE_P11, 9};
IfxPort_Pin IfxPort_P12_0 = {&MODULE_P12, 0};
IfxPort_Pin IfxPort_P12_1 = {&MODULE_P12, 1};
IfxPort_Pin IfxPort_P13_0 = {&MODULE_P13, 0};
IfxPort_Pin IfxPort_P13_1 = {&MODULE_P13, 1};
IfxPort_Pin IfxPort_P13_10 = {&MODULE_P13,10};
IfxPort_Pin IfxPort_P13_11 = {&MODULE_P13,11};
IfxPort_Pin IfxPort_P13_12 = {&MODULE_P13,12};
IfxPort_Pin IfxPort_P13_13 = {&MODULE_P13,13};
IfxPort_Pin IfxPort_P13_14 = {&MODULE_P13,14};
IfxPort_Pin IfxPort_P13_15 = {&MODULE_P13,15};
IfxPort_Pin IfxPort_P13_2 = {&MODULE_P13, 2};
IfxPort_Pin IfxPort_P13_3 = {&MODULE_P13, 3};
IfxPort_Pin IfxPort_P13_4 = {&MODULE_P13, 4};
IfxPort_Pin IfxPort_P13_5 = {&MODULE_P13, 5};
IfxPort_Pin IfxPort_P13_6 = {&MODULE_P13, 6};
IfxPort_Pin IfxPort_P13_7 = {&MODULE_P13, 7};
IfxPort_Pin IfxPort_P13_9 = {&MODULE_P13, 9};
IfxPort_Pin IfxPort_P14_0 = {&MODULE_P14, 0};
IfxPort_Pin IfxPort_P14_1 = {&MODULE_P14, 1};
IfxPort_Pin IfxPort_P14_10 = {&MODULE_P14,10};
IfxPort_Pin IfxPort_P14_11 = {&MODULE_P14,11};
IfxPort_Pin IfxPort_P14_12 = {&MODULE_P14,12};
IfxPort_Pin IfxPort_P14_13 = {&MODULE_P14,13};
IfxPort_Pin IfxPort_P14_14 = {&MODULE_P14,14};
IfxPort_Pin IfxPort_P14_15 = {&MODULE_P14,15};
IfxPort_Pin IfxPort_P14_2 = {&MODULE_P14, 2};
IfxPort_Pin IfxPort_P14_3 = {&MODULE_P14, 3};
IfxPort_Pin IfxPort_P14_4 = {&MODULE_P14, 4};
IfxPort_Pin IfxPort_P14_5 = {&MODULE_P14, 5};
IfxPort_Pin IfxPort_P14_6 = {&MODULE_P14, 6};
IfxPort_Pin IfxPort_P14_7 = {&MODULE_P14, 7};
IfxPort_Pin IfxPort_P14_8 = {&MODULE_P14, 8};
IfxPort_Pin IfxPort_P14_9 = {&MODULE_P14, 9};
IfxPort_Pin IfxPort_P15_0 = {&MODULE_P15, 0};
IfxPort_Pin IfxPort_P15_1 = {&MODULE_P15, 1};
IfxPort_Pin IfxPort_P15_10 = {&MODULE_P15,10};
IfxPort_Pin IfxPort_P15_11 = {&MODULE_P15,11};
IfxPort_Pin IfxPort_P15_12 = {&MODULE_P15,12};
IfxPort_Pin IfxPort_P15_13 = {&MODULE_P15,13};
IfxPort_Pin IfxPort_P15_14 = {&MODULE_P15,14};
IfxPort_Pin IfxPort_P15_15 = {&MODULE_P15,15};
IfxPort_Pin IfxPort_P15_2 = {&MODULE_P15, 2};
IfxPort_Pin IfxPort_P15_3 = {&MODULE_P15, 3};
IfxPort_Pin IfxPort_P15_4 = {&MODULE_P15, 4};
IfxPort_Pin IfxPort_P15_5 = {&MODULE_P15, 5};
IfxPort_Pin IfxPort_P15_6 = {&MODULE_P15, 6};
IfxPort_Pin IfxPort_P15_7 = {&MODULE_P15, 7};
IfxPort_Pin IfxPort_P15_8 = {&MODULE_P15, 8};
IfxPort_Pin IfxPort_P20_0 = {&MODULE_P20, 0};
IfxPort_Pin IfxPort_P20_1 = {&MODULE_P20, 1};
IfxPort_Pin IfxPort_P20_10 = {&MODULE_P20,10};
IfxPort_Pin IfxPort_P20_11 = {&MODULE_P20,11};
IfxPort_Pin IfxPort_P20_12 = {&MODULE_P20,12};
IfxPort_Pin IfxPort_P20_13 = {&MODULE_P20,13};
IfxPort_Pin IfxPort_P20_14 = {&MODULE_P20,14};
IfxPort_Pin IfxPort_P20_3 = {&MODULE_P20, 3};
IfxPort_Pin IfxPort_P20_6 = {&MODULE_P20, 6};
IfxPort_Pin IfxPort_P20_7 = {&MODULE_P20, 7};
IfxPort_Pin IfxPort_P20_8 = {&MODULE_P20, 8};
IfxPort_Pin IfxPort_P20_9 = {&MODULE_P20, 9};
IfxPort_Pin IfxPort_P21_0 = {&MODULE_P21, 0};
IfxPort_Pin IfxPort_P21_1 = {&MODULE_P21, 1};
IfxPort_Pin IfxPort_P21_2 = {&MODULE_P21, 2};
IfxPort_Pin IfxPort_P21_3 = {&MODULE_P21, 3};
IfxPort_Pin IfxPort_P21_4 = {&MODULE_P21, 4};
IfxPort_Pin IfxPort_P21_5 = {&MODULE_P21, 5};
IfxPort_Pin IfxPort_P21_6 = {&MODULE_P21, 6};
IfxPort_Pin IfxPort_P21_7 = {&MODULE_P21, 7};
IfxPort_Pin IfxPort_P22_0 = {&MODULE_P22, 0};
IfxPort_Pin IfxPort_P22_1 = {&MODULE_P22, 1};
IfxPort_Pin IfxPort_P22_10 = {&MODULE_P22,10};
IfxPort_Pin IfxPort_P22_11 = {&MODULE_P22,11};
IfxPort_Pin IfxPort_P22_2 = {&MODULE_P22, 2};
IfxPort_Pin IfxPort_P22_3 = {&MODULE_P22, 3};
IfxPort_Pin IfxPort_P22_4 = {&MODULE_P22, 4};
IfxPort_Pin IfxPort_P22_5 = {&MODULE_P22, 5};
IfxPort_Pin IfxPort_P22_6 = {&MODULE_P22, 6};
IfxPort_Pin IfxPort_P22_7 = {&MODULE_P22, 7};
IfxPort_Pin IfxPort_P22_8 = {&MODULE_P22, 8};
IfxPort_Pin IfxPort_P22_9 = {&MODULE_P22, 9};
IfxPort_Pin IfxPort_P23_0 = {&MODULE_P23, 0};
IfxPort_Pin IfxPort_P23_1 = {&MODULE_P23, 1};
IfxPort_Pin IfxPort_P23_2 = {&MODULE_P23, 2};
IfxPort_Pin IfxPort_P23_3 = {&MODULE_P23, 3};
IfxPort_Pin IfxPort_P23_4 = {&MODULE_P23, 4};
IfxPort_Pin IfxPort_P23_5 = {&MODULE_P23, 5};
IfxPort_Pin IfxPort_P23_6 = {&MODULE_P23, 6};
IfxPort_Pin IfxPort_P23_7 = {&MODULE_P23, 7};
IfxPort_Pin IfxPort_P24_0 = {&MODULE_P24, 0};
IfxPort_Pin IfxPort_P24_1 = {&MODULE_P24, 1};
IfxPort_Pin IfxPort_P24_10 = {&MODULE_P24,10};
IfxPort_Pin IfxPort_P24_11 = {&MODULE_P24,11};
IfxPort_Pin IfxPort_P24_12 = {&MODULE_P24,12};
IfxPort_Pin IfxPort_P24_13 = {&MODULE_P24,13};
IfxPort_Pin IfxPort_P24_14 = {&MODULE_P24,14};
IfxPort_Pin IfxPort_P24_15 = {&MODULE_P24,15};
IfxPort_Pin IfxPort_P24_2 = {&MODULE_P24, 2};
IfxPort_Pin IfxPort_P24_3 = {&MODULE_P24, 3};
IfxPort_Pin IfxPort_P24_4 = {&MODULE_P24, 4};
IfxPort_Pin IfxPort_P24_5 = {&MODULE_P24, 5};
IfxPort_Pin IfxPort_P24_6 = {&MODULE_P24, 6};
IfxPort_Pin IfxPort_P24_7 = {&MODULE_P24, 7};
IfxPort_Pin IfxPort_P24_8 = {&MODULE_P24, 8};
IfxPort_Pin IfxPort_P24_9 = {&MODULE_P24, 9};
IfxPort_Pin IfxPort_P25_0 = {&MODULE_P25, 0};
IfxPort_Pin IfxPort_P25_1 = {&MODULE_P25, 1};
IfxPort_Pin IfxPort_P25_10 = {&MODULE_P25,10};
IfxPort_Pin IfxPort_P25_11 = {&MODULE_P25,11};
IfxPort_Pin IfxPort_P25_12 = {&MODULE_P25,12};
IfxPort_Pin IfxPort_P25_13 = {&MODULE_P25,13};
IfxPort_Pin IfxPort_P25_14 = {&MODULE_P25,14};
IfxPort_Pin IfxPort_P25_15 = {&MODULE_P25,15};
IfxPort_Pin IfxPort_P25_2 = {&MODULE_P25, 2};
IfxPort_Pin IfxPort_P25_3 = {&MODULE_P25, 3};
IfxPort_Pin IfxPort_P25_4 = {&MODULE_P25, 4};
IfxPort_Pin IfxPort_P25_5 = {&MODULE_P25, 5};
IfxPort_Pin IfxPort_P25_6 = {&MODULE_P25, 6};
IfxPort_Pin IfxPort_P25_7 = {&MODULE_P25, 7};
IfxPort_Pin IfxPort_P25_8 = {&MODULE_P25, 8};
IfxPort_Pin IfxPort_P25_9 = {&MODULE_P25, 9};
IfxPort_Pin IfxPort_P26_0 = {&MODULE_P26, 0};
IfxPort_Pin IfxPort_P30_0 = {&MODULE_P30, 0};
IfxPort_Pin IfxPort_P30_1 = {&MODULE_P30, 1};
IfxPort_Pin IfxPort_P30_10 = {&MODULE_P30,10};
IfxPort_Pin IfxPort_P30_11 = {&MODULE_P30,11};
IfxPort_Pin IfxPort_P30_12 = {&MODULE_P30,12};
IfxPort_Pin IfxPort_P30_13 = {&MODULE_P30,13};
IfxPort_Pin IfxPort_P30_14 = {&MODULE_P30,14};
IfxPort_Pin IfxPort_P30_15 = {&MODULE_P30,15};
IfxPort_Pin IfxPort_P30_2 = {&MODULE_P30, 2};
IfxPort_Pin IfxPort_P30_3 = {&MODULE_P30, 3};
IfxPort_Pin IfxPort_P30_4 = {&MODULE_P30, 4};
IfxPort_Pin IfxPort_P30_5 = {&MODULE_P30, 5};
IfxPort_Pin IfxPort_P30_6 = {&MODULE_P30, 6};
IfxPort_Pin IfxPort_P30_7 = {&MODULE_P30, 7};
IfxPort_Pin IfxPort_P30_8 = {&MODULE_P30, 8};
IfxPort_Pin IfxPort_P30_9 = {&MODULE_P30, 9};
IfxPort_Pin IfxPort_P31_0 = {&MODULE_P31, 0};
IfxPort_Pin IfxPort_P31_1 = {&MODULE_P31, 1};
IfxPort_Pin IfxPort_P31_10 = {&MODULE_P31,10};
IfxPort_Pin IfxPort_P31_11 = {&MODULE_P31,11};
IfxPort_Pin IfxPort_P31_12 = {&MODULE_P31,12};
IfxPort_Pin IfxPort_P31_13 = {&MODULE_P31,13};
IfxPort_Pin IfxPort_P31_14 = {&MODULE_P31,14};
IfxPort_Pin IfxPort_P31_15 = {&MODULE_P31,15};
IfxPort_Pin IfxPort_P31_2 = {&MODULE_P31, 2};
IfxPort_Pin IfxPort_P31_3 = {&MODULE_P31, 3};
IfxPort_Pin IfxPort_P31_4 = {&MODULE_P31, 4};
IfxPort_Pin IfxPort_P31_5 = {&MODULE_P31, 5};
IfxPort_Pin IfxPort_P31_6 = {&MODULE_P31, 6};
IfxPort_Pin IfxPort_P31_7 = {&MODULE_P31, 7};
IfxPort_Pin IfxPort_P31_8 = {&MODULE_P31, 8};
IfxPort_Pin IfxPort_P31_9 = {&MODULE_P31, 9};
IfxPort_Pin IfxPort_P32_0 = {&MODULE_P32, 0};
IfxPort_Pin IfxPort_P32_1 = {&MODULE_P32, 1};
IfxPort_Pin IfxPort_P32_2 = {&MODULE_P32, 2};
IfxPort_Pin IfxPort_P32_3 = {&MODULE_P32, 3};
IfxPort_Pin IfxPort_P32_4 = {&MODULE_P32, 4};
IfxPort_Pin IfxPort_P32_5 = {&MODULE_P32, 5};
IfxPort_Pin IfxPort_P32_6 = {&MODULE_P32, 6};
IfxPort_Pin IfxPort_P32_7 = {&MODULE_P32, 7};
IfxPort_Pin IfxPort_P33_0 = {&MODULE_P33, 0};
IfxPort_Pin IfxPort_P33_1 = {&MODULE_P33, 1};
IfxPort_Pin IfxPort_P33_10 = {&MODULE_P33,10};
IfxPort_Pin IfxPort_P33_11 = {&MODULE_P33,11};
IfxPort_Pin IfxPort_P33_12 = {&MODULE_P33,12};
IfxPort_Pin IfxPort_P33_13 = {&MODULE_P33,13};
IfxPort_Pin IfxPort_P33_14 = {&MODULE_P33,14};
IfxPort_Pin IfxPort_P33_15 = {&MODULE_P33,15};
IfxPort_Pin IfxPort_P33_2 = {&MODULE_P33, 2};
IfxPort_Pin IfxPort_P33_3 = {&MODULE_P33, 3};
IfxPort_Pin IfxPort_P33_4 = {&MODULE_P33, 4};
IfxPort_Pin IfxPort_P33_5 = {&MODULE_P33, 5};
IfxPort_Pin IfxPort_P33_6 = {&MODULE_P33, 6};
IfxPort_Pin IfxPort_P33_7 = {&MODULE_P33, 7};
IfxPort_Pin IfxPort_P33_8 = {&MODULE_P33, 8};
IfxPort_Pin IfxPort_P33_9 = {&MODULE_P33, 9};
IfxPort_Pin IfxPort_P34_1 = {&MODULE_P34, 1};
IfxPort_Pin IfxPort_P34_2 = {&MODULE_P34, 2};
IfxPort_Pin IfxPort_P34_3 = {&MODULE_P34, 3};
IfxPort_Pin IfxPort_P34_4 = {&MODULE_P34, 4};
IfxPort_Pin IfxPort_P34_5 = {&MODULE_P34, 5};
IfxPort_Pin IfxPort_P40_0 = {&MODULE_P40, 0};
IfxPort_Pin IfxPort_P40_1 = {&MODULE_P40, 1};
IfxPort_Pin IfxPort_P40_10 = {&MODULE_P40,10};
IfxPort_Pin IfxPort_P40_11 = {&MODULE_P40,11};
IfxPort_Pin IfxPort_P40_12 = {&MODULE_P40,12};
IfxPort_Pin IfxPort_P40_13 = {&MODULE_P40,13};
IfxPort_Pin IfxPort_P40_14 = {&MODULE_P40,14};
IfxPort_Pin IfxPort_P40_15 = {&MODULE_P40,15};
IfxPort_Pin IfxPort_P40_2 = {&MODULE_P40, 2};
IfxPort_Pin IfxPort_P40_3 = {&MODULE_P40, 3};
IfxPort_Pin IfxPort_P40_4 = {&MODULE_P40, 4};
IfxPort_Pin IfxPort_P40_5 = {&MODULE_P40, 5};
IfxPort_Pin IfxPort_P40_6 = {&MODULE_P40, 6};
IfxPort_Pin IfxPort_P40_7 = {&MODULE_P40, 7};
IfxPort_Pin IfxPort_P40_8 = {&MODULE_P40, 8};
IfxPort_Pin IfxPort_P40_9 = {&MODULE_P40, 9};
IfxPort_Pin IfxPort_P41_0 = {&MODULE_P41, 0};
IfxPort_Pin IfxPort_P41_1 = {&MODULE_P41, 1};
IfxPort_Pin IfxPort_P41_2 = {&MODULE_P41, 2};
IfxPort_Pin IfxPort_P41_3 = {&MODULE_P41, 3};
IfxPort_Pin IfxPort_P41_4 = {&MODULE_P41, 4};
IfxPort_Pin IfxPort_P41_5 = {&MODULE_P41, 5};
IfxPort_Pin IfxPort_P41_6 = {&MODULE_P41, 6};
IfxPort_Pin IfxPort_P41_7 = {&MODULE_P41, 7};
IfxPort_Pin IfxPort_P41_8 = {&MODULE_P41, 8};


